{
  "breakfast": [
    {
      "img": "./assets/images/breakfast/b1.jpg",
      "name": "Pasta in White Sauce",
      "detail": "Alfredo Pasta, Indian Style | Kiddie Lunch-box Special",
      "url": "Am-ApIhl-OI",
      "ingredient": [
        "Spiral Pasta - 1 1/4 cup",
        "Oil - 1 tbsp",
        "Salt - to taste",
        "Butter - 2 tbsp",
        "Plain Flour/Maida - 1 1/2 tbsp",
        "Milk - 1 cup",
        "Salt - to taste",
        "Pepper - 1/4 tsp",
        "Cheese - 1/4 cheese",
        "Olive Oil -",
        "Garlic - 1 tsp",
        "Green Chili - 1/2 tsp finely chopped",
        "Basil -",
        "Corn - 1/4 cup",
        "Capsicum - all 3 colors (1/4 cup each)",
        "Onion - 1/4 cup"
      ],
      "steps": [
        "Start by boiling a couple of cups of water, to that add a tablespoon of regular oil and salt to taste. Throw in the pasta and let it boil till Al dente, strain and keep aside.",
        "In a saucepan, make a roux by adding the butter and flour and cook for a moment. Pour in a little amount of milk at a time to avoid lumps and stir regularly. Season with salt and pepper and cook till thick. Switch off the flame, and add the cheese in. Béchamel sauce is ready.",
        "In a wok/pan, add the olive oil. Once hot add the garlic and chili. Saute and tear the basil leaves in, add the onions, red green and yellow bell pepper and corn. Stir it up well..",
        "Season with salt and pepper, add the pasta and toss it up! Pour the Béchamel in, and stir, stir stir. Ready to be served, bon appétit!"
      ]
    },
    {
      "img": "./assets/images/breakfast/b2.jpg",
      "name": "Veggie Nuggets",
      "detail": "Crispy, Healthy - Loaded with Crunchy Veggies | Snack ON!",
      "url": "jJgEVIGYPsM",
      "ingredient": [
        "Oil - to fry",
        "Potato - 6 medium boiled",
        "Chopped Zucchini - 1/4 cup",
        "Chopped French Beans - 1/4 cup",
        "Onion - 1/4 cup",
        "Carrot - 1/3 cup",
        "Peas - 1/2 cup",
        "Sweet Corn - 1/4 cup",
        "Coriander - Chopped",
        "Corn Flour - 1/4 cup (dissolved in 1 cup water)",
        "Ginger - 1/2 inch chopped",
        "Green Chili - 1 large",
        "Oregano - 1/2 tsp",
        "Thaeen - 1/2 tsp",
        "Garlic Powder - 1/2 tsp",
        "Salt - to taste",
        "Lemon Juice - of 1/2 lemon",
        "Black Pepper - 1 tsp",
        "Bread Crumbs - 1/2 cup",
        "Oil - to fry"
      ],
      "steps": [
        "Heat up a wok with the oil to fry the nuggets.",
        "In a mixing bowl, add the potatoes, mash them. Add in everything else except the bread crumbs.",
        "Mix well, add 1/4 C to 1/2 C breadcrumbs depending upon the moisture level of the mix and mix well.",
        "Make portions and shape into nuggets. Dip in corn flour mix and coat in bread crumbs. Re coat if you wish to.",
        "Fry in medium high flame until golden and enjoy with avocado & kiwi salsa or ketchup! :)"
      ]
    },
    {
      "img": "./assets/images/breakfast/b3.jpg",
      "name": "Veg Grill Sandwich",
      "detail": "Quick & Easy Indian Snack Street Style",
      "url": "Kjtn2LG_x5k",
      "ingredient": [
        "Bread - 6",
        "Cheese Cubes - 2",
        "Potato - sliced",
        "Tomato - sliced",
        "Capsicum - julienned",
        "Cucumber - sliced",
        "Butter - as required",
        "Green Chutney - as required",
        "Salt - as required",
        "Chaat Masala -",
        "Ketchup - as required"
      ],
      "steps": [
        "Start by preheating the Sandwich Griller.",
        "Spread Butter in the Bread, One bread with butter on both sides(goes in center), and two breads with butter in one side(remains up & down).",
        "Smear Green Chutney in one of the bread(butter side down, then sliced boiled potato, and juliennes of bell pepper. Sprinkle salt and generous amount of chat masala. Then grate some cheese.",
        "Then spread tomato ketchup in one side and gr chutney in the other side over the buttered bread. Keep the bread over the cheese, then place sliced tomato and cucumber.",
        "Sprinkle Salt and Generous amount of chat masala, Grate cheese on top. Spread tomato ketchup in another bread and place it over the cheese(butter side up).",
        "Make one more similarly, and keep the sandwiches to grill in the griller until golden, take out using a tong optionally smear a touch of butter and sprinkle some chat masala. Cut into two and ENJOY! :)"
      ]
    },
    {
      "img": "./assets/images/breakfast/b4.jpg",
      "name": "Vegetable Wrap",
      "detail": "Leftover Rotis - Easy, Healthy Kids Lunch Box",
      "url": "7N0GCM0weuM",
      "ingredient": [
        "Yogurt - 1 tsp",
        "Chaat Masala - 1 1/2 tsp",
        "Kashmiri Red Chili Powder - 1 tsp",
        "Green Chutney - 3 tbsp",
        "Salt - to taste",
        "Paneer Strips - 6-7",
        "Oil - 1/2 tsp",
        "Carrot - 1/2 cup",
        "Beans - 2",
        "Onion - 1/4 tsp",
        "Capsicum - 1/2 cup",
        "Salt - as required",
        "Cabbage - 1/4 cup"
      ],
      "steps": [
        "Start by marinating paneer, to do so take a plate, add the yogurt, 1 tsp chat masala, 1 tsp kashmiri red chili powder, about 1/2 tbsp of green chutney and salt to taste. Mix well and then add the paneer strips and coat well.",
        "Cook the paneer strips in a hot pan with some oil until golden, flip and cook on both sides. Keep aside.",
        "In the same pan, add about 1/2 tsp of oil and then add the carrots, beans, onions, capsicums. Saute for two minutes. Add the chat masala, switch off the flame and add the salt. Stir well for a minute, add the cabbage and stir well. Transfer to a plate and let it cool. The veggies should be cooked, but need to have a slight crunch.",
        "To make the wrap, take a roti, smear about a tablespoon of chutney. Then some lettuce, vegetable mix, paneer, sprinkle of salt, some ketchup, and roll it up! Either wrap half of it with aluminum foil and pack, or pack however you wish or just half it and serve! Enjoy the delicious wrap :)"
      ]
    },
    {
      "img": "./assets/images/breakfast/b5.jpg",
      "name": "Vegetable Cutlet",
      "detail": "Crispy Street Style Evening Snack",
      "url": "Om3jqzfT9Fc",
      "ingredient": [
        "Oil - 1 tbsp",
        "Green Chili - 2 small finely chopped",
        "Ginger - 1 inch finely chopped",
        "Onions - 2 med finely chopped",
        "Matar / Peas - 4 tbsp frozen",
        "Beetroot - 3 tbsp finely chopped",
        "Carrot - 1 small finely chopped",
        "French Beans - 5-6 medium finely chopped",
        "Salt - 1 tsp",
        "Coriander Powder - 1/2 tsp",
        "Red Chili Powder - 1/2 tsp",
        "Garam Masala - 1/2 tsp",
        "Amchoor Powder / Mango Powder - 1/4 tsp",
        "Chopped Coriander - 1 tbsp",
        "Boiled Potatoes - 5 medium and mashed",
        "Maida - 1/4 cup",
        "Water - as required"
      ],
      "steps": [
        "In a preheated kadhai, pour oil, add the green chilies and ginger and fry for few minutes. Add onion and matar and cook for 2 minutes.",
        "Add beetroot, carrots, beans and salt. Now add the seasoning coriander powder, red chilli powder, garam masala, amchoor powder or lemon juice and fresh coriander. Stir everything together and cook for 4-5 minutes.",
        "Next add mashed potatoes, give a good mix until everything is well combined. Adjust seasoning to taste. Turn off flame and set aside.",
        "In a small bowl combine maida and water as required to make a thin batter. Batter should not be too thick or too thin and transfer the breadcrumbs in a large plate",
        "Once the potato mixture has slightly cooled, start shaping them in any shape you like.",
        "Dip the prepared cutlets one at a time into the batter and then coat the cutlets with breadcrumbs on all sides. Continue the same 'steps' for the remaining of the cutlets.",
        "In a deep frying pan, heat the oil on medium flame. Add the cutlets in batches. Deep fry them over medium flame or until they are golden brown.",
        "Follow the same procedure for the remaining cutlets. Remove on a kitchen towel."
      ]
    },
    {
      "img": "./assets/images/breakfast/b6.jpg",
      "name": "Veg Crispy",
      "detail": "Restaurant Style Starter – Indo Chinese Food",
      "url": "cu5EbFkz8Og",
      "ingredient": [
        "Plain Flour / Maida - 3/4 cup",
        "Corn flour - 3/4 cup",
        "Coriander - 1 tbsp chopped",
        "Sesame Seeds - 1 tsp",
        "Black Pepper - 1 tsp",
        "Salt - to taste",
        "Lemon Juice - 1 tsp",
        "Chilli paste - 4 tbsp",
        "Ginger Garlic Paste - 1 tbsp",
        "Water - as required",
        "Oil - for frying",
        "Capsicum - 1 medium cut in strips",
        "Carrot - 1 medium",
        "Potato - 1 medium",
        "Cauliflower - 3 florets",
        "Paneer - 100 gms",
        "Coriander - 1 tsp chopped"
      ],
      "steps": [
        "Cut all the vegetables into long thick strips. Set aside",
        "In a large bowl combine maida, corn flour, coriander, sesame seeds, black pepper, salt, lemon juice, red chilli paste and ginger garlic paste. Stir well until all ingredients are combined.",
        "Add water little at a time to the mixture, keep stirring to form a thick batter consistency",
        "Add the Carrots and Potatoes to the mixture and mix until both the vegetables are well coated.",
        "In a deep frying pan, heat the oil on medium flame. Add the vegetables in batches. Deep fry the vegetables for 6-7 minutes or until they are light and crunchy.",
        "Follow the same procedure for the remaining vegetables. Remove on a kitchen towel.",
        "Garnish with chopped coriander and curry leaves. Serve Vegetable Crispy with ketchup or any chutney of your choice"
      ]
    },
    {
      "img": "./assets/images/breakfast/b7.jpg",
      "name": "Veg Bullets",
      "detail": "Quick & Easy Snack Recipes | Snack ON!",
      "url": "HKr07gvfPpM",
      "ingredient": [
        "Hudson Canola Oil - to deep fry",
        "Grated Carrot - 4 - 5",
        "Potato - 2 (boiled & mashed)",
        "Coriander - 1 tbsp",
        "Green Chili - 1/2 tsp",
        "Ginger Garlic Paste - 1 tsp",
        "Nutmeg - a pinch",
        "Cinnamon - a pinch",
        "Red Chilli Powder - 1/2 tsp",
        "Plain Flour - 2 tbsp",
        "Custard Powder - 2 tbsp",
        "Salt - as per taste",
        "Bread Crumbs - to coat",
        "Custard Powder - to coat"
      ],
      "steps": [
        "Start by heating up Hudson Canola Oil in a pan for deep frying.",
        "In a mixing bowl, add the grated carrots, boiled and mashed potatoes, coriander, green chili, ginger garlic paste and mix well.",
        "Now add in the nutmeg, cinnamon, red chili powder, plain flour and custard powder and incorporate it well.",
        "Just before youre ready to shape and fry, add the salt in mix well and make long cylindrical type shapes of about 3 inches.",
        "Coat it in custard powder well, then roll it between your hands to make sure its coated well, dip in water and roll in bread crumbs. Roll it in your hands to make sure the bread crumbs stick.",
        "Once these are ready, deep fry till half way done in medium flame.",
        "Take them out once halfway cooked, and let them cool. Increase the flame to high and let the oil get hot well, and then add the bullets to the hot oil. Fry until crunchy and serve! ENJOY!"
      ]
    },
    {
      "img": "./assets/images/breakfast/b8.jpg",
      "name": "Macaroni Pasta",
      "detail": "Top it off with coriander and a touch of black pepper and ENJOY :)",
      "url": "4q8GwxethQ0",
      "ingredient": [
        "Water - to boil",
        "Salt - 1 tsp",
        "Oil - 1 tbsp",
        "Macaroni - 1 1/2 cups",
        "Oil - 2 - 3 tbsp",
        "Cumin Seeds - 1 tsp",
        "Ginger - 1 tsp chopped",
        "Garlic - 1 tsp chopped",
        "Green Chili - 1 tsp finely chopped",
        "Onion - 1 cup finely chopped",
        "Tomatoes - 2 cups",
        "Salt - to taste",
        "Mixed Vegetables - 1/2 cup (carrot, french beans, cauliflowers)",
        "Red Chili Paste - 1 tsp",
        "Ketchup - 2 - 3 tbsp",
        "Chaat Masala - 1 tsp",
        "Red Chili Powder - 1/2 tsp",
        "Garam Masala - a pinch",
        "Coriander - 1/2 tbsp",
        "Black Pepper Powder -"
      ],
      "steps": [
        "Start by boiling a couple of cups of water, add salt to taste and a tbsp of Hudson Canola Oil. Add the macaroni and boil till cooked well but has a bite, in other words Al Dente. Strain the pasta and rinse under cold water.",
        "Heat up a wok or a pan, and add in 2 tbsps of Hudson Canola Oil, once its hot add the cumin seeds. Next goes in the ginger, chili and garlic. Saute for a moment.",
        "Add the onions and cook till the onions are translucent, then add in the tomatoes. Stir and add in the salt to taste. Cook till the tomatoes are mushy.",
        "Add the veggies, and cook for another two-three minutes. Add the ketchup and red chili paste, stir and cook for a minute.",
        "Season it with chat masala, red chili powder and a little bit of garam masala, cook the spices for 2 minutes.. Add the macaroni and mix well.. Top it off with coriander and a touch of black pepper and ENJOY :)"
      ]
    },
    {
      "img": "./assets/images/breakfast/b9.jpg",
      "name": "Kurkure Momos",
      "detail": "Sprinkle chat masala and serve the kurkure Momos",
      "url": "BYe5YeWc_dk",
      "ingredient": [
        "Soya keema Granules / Nutrela - 1/2 cup",
        "Water - 1 cup",
        "Butter - 2 tbsp",
        "Garlic - 3-4 cloves finely chopped",
        "Ginger - 1 inch grated",
        "Green Chili - 2 small finely chopped",
        "Onion - 1 medium finely chopped",
        "Carrot - 2 tbsp finely chopped, optional",
        "Salt - 1/2 tsp",
        "Black Pepper - 1/2 tsp",
        "Schezwan sauce - 1 tbsp",
        "Cabbage - 1/2 large grated",
        "Maida - 1/2 cup",
        "Corn flour - 1/2 cup",
        "Kashmiri Red Chili Powder - 1 tbsp",
        "Garam Masala - 1/2 tsp",
        "Chat Masala - 1 tsp",
        "Pudina Powder - 1/2 tsp",
        "Salt - to taste",
        "Black Pepper - to taste",
        "Water - as required",
        "Corn Flakes - 1 cup crushed"
      ],
      "steps": [
        "In a mixing bowl combine water and soya keema granules; soak it for about 15 minutes.",
        "In a preheated kadhai or wok, add the butter, garlic, ginger and green chili.",
        "Before adding the soaked soya granules, squeeze out the excess water and place it in the wok.",
        "Mix everything together and cook it for 2 minutes. The butter will bring out a very good flavour to the soya mixture.",
        "Add the onions and carrots and stir everything. Add salt, pepper, schezwan sauce and cabbage.",
        "Cook everything for 2 minutes, do not overcook or else the filling will be very dry. Turn off the flame and set the filling mixture aside."
      ]
    },
    {
      "img": "./assets/images/breakfast/b10.jpg",
      "name": "Kung Pao Potatoes",
      "detail": "Garnish with spring onions green and serve the hot Kung Pao",
      "url": "qPpgUIx1Ipc",
      "ingredient": [
        "Sesame Oil - 2 tbsp or any other oil",
        "Green Chili - 2 small finely chopped",
        "Garlic - 1 tbsp chopped",
        "Sichuan Peppercorn - 1 tsp",
        "Peanuts - 2-3 tbsp roasted",
        "Dry Red Chili - 3 small",
        "Red Chili sauce / Sriracha - 1 1/2 tbsp",
        "Onion - 1 small cubed",
        "Mixed Bell Peppers - 1/2 cup red, yellow and green",
        "Spring Onions Green - 1 tbsp finely chopped",
        "Sugar - 1 tsp",
        "Salt - 1 pinch to taste",
        "Black Pepper Powder - 1/4 tsp optional",
        "Tomato Ketchup - 1 tbsp",
        "Light Soya Sauce - 1 tsp",
        "Lemon Juice - 1/2 tsp",
        "Water - 1/2 cup",
        "Corn flour - 1 tbsp",
        "Water - 3-4 tbsp"
      ],
      "steps": [
        "In a large deep pan, heat the oil and fry the potatoes over medium flame, until they are golden brown.",
        "After about 9-10 minutes, using a fork test if the potatoes are tender and soft in the center. Remove and place it on a kitchen towel.",
        "In a preheated wok, pour sesame oil, add the green chili, garlic, Sichuan peppercorn, roasted peanuts and broken dry red chili. Give it a good stir over high heat.",
        "Next add the Sriracha or red chili sauce, and cook for 1 minute. Add onions, bell peppers and spring onions green. Stir fry everything.",
        "Add sugar, salt, black pepper, tomato ketchup, light soya sauce and lemon juice. Stir fry everything for 2-3 minutes.",
        "Pour water and bring it to a boil. Add the slurry, little at a time, depending on the consistency you like",
        "Once the sauce is thick, add the fried potatoes. Give it a good mix and coat all the potatoes with the sauce"
      ]
    }
  ],
  "lunch": [
    {
      "img": "./assets/images/lunch/l1.jpg",
      "name": "Vegetable Pulav",
      "url": "xvJ4fQNr5j8",
      "detail": "Microwave Veg Pulao | Stir it Up, QUICK!",
      "ingredient": [
        "Oil - 1/2 tbsp",
        "Cumin Seeds - 1 tsp",
        "Green Chili - 1 tsp (chopped)",
        "Carrot - 3 - 4 tbsp",
        "French Beans - 3 - 4 tbsp",
        "Green Peas - 2 - 3 tbsp",
        "Sweet Corn - 2 - 3 tbsp",
        "Salt - as per taste",
        "Soaked Rice - 1 cup",
        "Water - 2 cups",
        "Coriander - finely chopped"
      ],
      "steps": [
        "Start by adding the oil, cumin seeds, chili and all the veggies and the salt in a bowl. Stir it up, and Microwave for 1 minute at full power.",
        "Add the soaked rice, and two cups of water. Microwave for 14 minutes at full power. Mine is a 800w, adjust time as per your one.",
        "Let the rice rest for 10 mins before serving, add some coriander and fluff it up! Serve hot, as it is with some raita or some of our Paneer Sabzi."
      ]
    },
    {
      "img": "./assets/images/lunch/l2.jpg",
      "name": "Mushroom Masala",
      "url": "69bxGa1pgVY",
      "detail": "Spicy Indian Gravy Curry Restaurant Style",
      "ingredient": [
        "Mustard Oil - 2 tbsp",
        "Cinnamon - 1 stick",
        "Cloves - 4-5 small",
        "Cumin Seeds - 1 tsp",
        "Curry Leaves - 1 sprig",
        "Cashew nuts - 2-3 tbsp optional",
        "Onion - 2 small finely chopped",
        "Salt - 1 tsp",
        "Ginger Garlic Paste - 1/2 tsp optional",
        "Coriander Powder - 1 tsp",
        "Red Chili Powder - 3/4 tsp",
        "Kashmiri Red Chili Powder - 3/4 tsp",
        "Garam Masala - 3/4 tsp",
        "Black Pepper - 1/2 tsp",
        "Haldi - 1/4 tsp",
        "Besan - 1 tbsp",
        "Frozen Matar - 2-3 tbsp or fresh matar",
        "Dahi - 1/2 cup",
        "Coriander Leaves - 2 tbsp chopped",
        "Tomaotes - 2-3 large chopped",
        "Capsicum - 1/2 small cut long",
        "Green Chili - 2 small slit",
        "Water - 1/4 cup optional",
        "Coriander - chopped for garnish"
      ],
      "steps": [
        "Preheat a kadhai over high heat, add the mustard oil, once it’s hot add the cinnamon stick, cloves, cumin seeds, curry leaves and chopped cashew nuts. Cook everything for few seconds.",
        "Add the onions and cook for 2-3 minute and then add the salt, continue to cook the onions over medium flame until they are golden.",
        "Once the onions are light golden then add ginger garlic paste and cook for further for 2 minutes.",
        "Add the masalas, coriander powder, red chili powder, Kashmiri red chili powder, garam masala, black pepper, haldi and finally add besan.",
        "Roast everything for 2 minutes, then add the matar and give it a stir. Turn off the flame",
        "Add dahi, and mix everything until well combined. Once done turn on the flame and cook for 3-4 minute",
        "Once the gravy has thickened then add chopped coriander leaves and tomatoes, cook until the tomatoes get mushy",
        "You can cook them over high heat but continuously stir it, or cook over medium heat, but cover the kadhai and cook for 5-6 minutes.",
        "Add the capsicum followed by green chili; stir everything until the gravy leaves the side of the pan and the masala gets a glaze.",
        "Cover the kadhai and over low flame cook for 3-4 minute. You can serve the mushroom masala dry or you can add some water and adjust the consistency at this stage.",
        "Once you add the water give it a good mix, bring it to a boil and add some chopped coriander and serve."
      ]
    },
    {
      "img": "./assets/images/lunch/l3.jpg",
      "name": "Mili Juli Sabzi",
      "url": "95fmmbR86o8",
      "detail": "Hey Foodies, Here another sabzi for you...",
      "ingredient": [
        "Onion - 1 finely chopped",
        "Coconut - 1/4 cup",
        "Potato - 1/4 cup (roughly diced)",
        "Carrot - 1/4 cup (roughly diced)",
        "Cauliflower - 1/4 (small florets)",
        "Beans - 1/4 cup (chopped)",
        "Paneer - 50 gm (cubed)",
        "Oil - 2 tbsp + as required to shallow fry veggies",
        "Cumin Seeds - 1/2 tsp",
        "Asafoetida - 1/4 tsp",
        "Curry Leaves - 4-5",
        "Green Chili - 2 (slits)",
        "Dry Red Chili - 3 + 1",
        "Bay Leaf - 2",
        "Ginger Garlic Paste - 1/2 tbsp",
        "Blended Tomatoes - 6 medium",
        "Salt - as per taste",
        "Kashmiri Red Chili Powder - 1 tsp",
        "Black Pepper - 1/4 tsp",
        "Amchoor - 1 tsp",
        "Garam Masala - 1 tsp",
        "Sambhar Masala - 1 tsp",
        "Sugar - 1/4 tsp",
        "Coriander - handful (chopped)",
        "Corn Flour - 1/2 tsp",
        "Capsicum - 1/4 cup (roughly diced)",
        "Coconut Milk - 3 tbsp"
      ],
      "steps": [
        "Preparing Vegetables: Heat up a pan, add 1 - 1 1/2 tbsp oil, followed by the carrots & potatoes. Stir occasionally and cook till golden then takedown in a bowl. When the potatoes & carrots are done, add the beans & cauliflower to the pan and cook till golden transfer to the same bowl.",
        "Then add about 1/2 tbsp of more oil if needed, and add the paneer cubes & cook till golden. Take down these paneer cubes separately.",
        "Brown Onion Paste with Coconut: In another pan, add about a tablespoon of oil and the two chopped onions, Stir & cook till brown in medium flame. Add the 1/4 cup of fresh coconut & cook for a minute. Let it cool down to room temperature and then blend to a paste.",
        "Preparing the sabzi: In a kadhai or wok heating up in medium flame, add in 2 tbsp of oil. After it gets hot, add cumin seeds, asafoetida, curry leaves, slit green chili, dry red chili, bay leaf. Stir and cook for 3-4 seconds, then add in the ginger garlic paste & cook for half a minute.",
        "Now, add in the brown onion paste we made earlier & cook it until it starts leaving the sides of the pan & starts oozing out oil. Pour in the blended tomatoes, add salt as per taste & cook till it starts leaving the sides of the pan.",
        "Add the masalas to it: Kashmiri red chili powder, black pepper, amchoor powder, garam masala & sambhar powder, and a pinch of sugar. Also, add in a handful of chopped coriander and stir well, cook for a good minute or two.",
        "Dissolve the 1/2 tsp corn flour in 1 tbsp water. Pour that in to the gravy, mix well.. Then add the roughly diced capsicum, fried vegetables(only veggies not paneer.) & about 3 tbsp of coconut milk. Stir well, add a cup or two of water & cook it for 2-3 minutes in medium flame.",
        "Then add in the fried paneer, stir well cook for a minute and transfer to a serving platter.",
        "For Tadka Garnish. In a tadka pan, add a tsp of oil. Once hot, add in the mustard seeds. As they splutter, add the chana & urad dal & stir till golden. Then add the curry leaves & dry red chili. Switch off the flame, add a good tsp of chopped coriander & pour right into the sabzi. Serve hot."
      ]
    },
    {
      "img": "./assets/images/lunch/l4.jpg",
      "name": "Lachha Paratha",
      "url": "d4GdyA0rIX0",
      "detail": "Something flaky, something crispy and something super tasty ",
      "ingredient": [
        "Maida - 2 cup",
        "Ghee - 3 tbsp or melted dalda",
        "Salt - 1 1/2 tsp",
        "Sugar - 1 tsp",
        "Ghee - 1/4 cup",
        "Maida - 1/2 cup",
        "Pudina Powder - 2 tbsp",
        "Ghee - to fry the parathas",
        "Water - as required for kneading",
        "Dry Maida - for dusting"
      ],
      "steps": [
        "Preheat the iron tava, and place the rolled lachha paratha on it, and cook it over high heat for 1 minute",
        "Flip the paratha and, spread some ghee using a spoon. Flip it and spread some more ghee.",
        "Cook the parathas over medium high flame, using a flat spoon press the parathas down so that they are evenly cooked and is crispy. You will begin to see golden spots.",
        "Follow the same 'steps' and cook the remaining parathas"
      ]
    },
    {
      "img": "./assets/images/lunch/l5.jpg",
      "name": "Keema Masala",
      "url": "D3WWoSwBxKo",
      "detail": "Slow cooked Veg Soya Kheema is ready to be served",
      "ingredient": [
        "Soya keema Granules / Nutrela - 1 cup",
        "Water - to soak the soya granules",
        "Tomatoes - 3 medium halved or grated",
        "Onion - 1 medium halved and grated",
        "Green Chillies - 3 medium slit",
        "Garlic - 3 cloves finely chopped",
        "Fresh Coriander - 2 tbsp finely chopped",
        "For the kheema/ qeema masala / spice mix",
        "Whole Coriander seeds - 2 tsp",
        "Fennel Seeds - 2 tsp",
        "Nutmeg - 1/3 tsp",
        "Green Cardamom - 3 small",
        "Gram Flour / Besan - 1 tbsp",
        "Black Pepper - 1/2 tsp",
        "Cumin Powder - 1/2 tsp",
        "Salt - to taste"
      ],
      "steps": [
        "Grind the soya granules until you get a coarse texture",
        "In a preheated iron pan or kadhai, add the ghee. Once hot add jeera and allow it to crackle. Add cloves, cinnamon stick. Roast everything for few minutes.",
        "Add garlic and onions and cook for 2-3 minutes",
        "Finally add the blended masala and butter. Stir everything cook over high flame for 2-3 minutes",
        "Next add the blended tomatoes, cook everything until the tomatoes leaves the sides of the pan.",
        "Add the fresh coriander, slit green chilies and crumbled paneer. Stir until everything well combined.",
        "Finally add the blended soya granules, cook everything until all well combined, add butter if required. Mix everything together and cook it for 2 minutes.",
        "Pour some water and then cover the pan and continue to cook for 5 minutes at medium to low flame."
      ]
    }
  ],
  "dinner": [
    {
      "img": "./assets/images/dinner/d1.jpg",
      "name": "Butter Paneer Masala",
      "url": "oYZ--rdHL6I",
      "detail": "Feel free to taste and adjust the taste.",
      "ingredient": [
        "Tomato - 8",
        "Paneer Cubes - 200 gm",
        "Fresh Coriander - 2 tbsp",
        "Onion - 3",
        "Butter - 3 tbsp (or more)",
        "Black Cardamom - 2",
        "Green Cardamom - 4",
        "Bay Leaf - 2",
        "Cumin - 1 tsp",
        "Dry Red Chili - 2",
        "Oil - 2 tbsp",
        "Ginger Garlic Paste - 1 1/2 tbsp",
        "Salt - to taste",
        "Kashmiri Red Chili Powder - 2 tbsp",
        "Cumin Powder - 1 tsp",
        "Garam Masala - 1 tsp",
        "Fenugreek leaves - 1 tsp",
        "Cream - 3 tbsp",
        "Green Chili - 3 (slits)",
        "Papad - 1"
      ],
      "steps": [
        "Puree the tomatoes and mince the onions.",
        "In a pan, add the oil. Once hot, add the cumin seeds, dried red chilies, bay leaf, and open the cardamoms and add them and then add add ginger garlic paste as well. Let them sizzle.",
        "Add the butter, once it melts well add the minced onions and salt. Stir well and cook in medium flame until light golden.",
        "Then add in the tomato pulp. Stir and as it gets a roaring boil cover and cook for about 15 minutes or until it leaves the sides checking every 2-3 minutes to prevent burning.",
        "Add the cumin powder, red chili powder, garam masala and kasoori methi. Crush the kasoori methi in between your hands before adding.",
        "While the spices cook for a minute roast a papad, crush and keep aside.",
        "And, as the spices are cooked add the water depends. I added about 1 cup in total. Followed by chopped coriander and the cubed paneer and cream.",
        "Stir well and cook for about 5 minutes. I like my sabzi a wee bit on the thicker side, if you wish you can make it little thinner by adding more water.",
        "Add the slit chilies and the papad. Stir well and serve hot with tandoori rotis, naans, rice or just dig in with a spoon!"
      ]
    },
    {
      "img": "./assets/images/dinner/d1.jpg",
      "name": "Tandoori Paneer Tikka",
      "url": "n-8etlTdjOA",
      "detail": "We’ve made a few tandoori recipes earlier, but in our very own tandoor",
      "ingredient": ["Tomato - 1",
        "Roasted Besan - 3 1/2 tbsp",
        "Cashewnut Powder - 1 tbsp",
        "Ginger Garlic Paste - 1/2 tbsp",
        "salt - 1 1/4 tsp",
        "Sugar - 1/4 tsp",
        "Curry Leaves - 4",
        "Nutmeg Powder - 1 Pinch",
        "Kashmiri Red Chili Powder - 1/2 tbsp",
        "Cumin Powder - 1/2 tsp",
        "Garam Masala - 1/2 tsp",
        "Black Pepper - 1/4 tsp",
        "Lemon Juice - 1/4 tsp",
        "Kasoori methi - 1/4 tsp (Broiled & Crushed)",
        "Mustard Oil - 1 tsp",
        "Paneer - 250 grams Cubed",
        "Bell Peppers - 16 dices"
       ],
      "steps": ["For Marinate : Grill a tomato over direct flame until completely charred. Then put in ice cold water, remove skin and blitz in a blender and add to a bowl.",
        "To the bowl, also add - roasted besan, cashewnut powder, ginger garlic paste, sugar, salt, curry leaves, kashmiri red chili powder, garam masala, cumin powder, kasoori methi, nutmeg, black pepper, lemon juice. Mix well.",
        "Heat up the mustard oil until it starts smoking and then add to the marinate. If the consistency is extremely thick, then a tbsp of yogurt can be added.",
        "Add the paneer cubes and coat the paneer gently in the marinate. Place a heatsafe small bowl inside the mixing bowl with the marinated paneer. In the heatsafe bowl, place one hot and activated charcoal and pour in the ghee. Quickly cover bowl and let the paneer marinate for 1 1/2 hours.",
        "Before Cooking : You can take out the paneer from the marinate and put in the dices of bell peppers and onions and marinate them.",
        "Before Cooking : You can take out the paneer from the marinate and put in the dices of bell peppers and onions and marinate them.",
        "Cooking : Heat up a Grill Pan/Tawa in medium-high flame. Drizzle over a tsp of oil. Place the marinated onions and peppers and cook till you see the one side is done, after which turn and cook till its done and you see some dark spots. Take the peppers and onions out.",
        "Drizzle a tsp of oil in the pan, and place the marinated paneer. Cook the paneer in medium flame until done. About 30-45 seconds on each side, Serve Hot!"
    ]
    },
    {
      "img": "./assets/images/dinner/d3.jpg",
      "name": "Pindi Chole Recipe",
      "url": "KADSpikp0vk",
      "detail": "Pindi Chole is a classic dish from Punjab. It is spicy in nature and is flavored",
      "ingredient": ["Chole - 1 cup",
        "Tea Leaves - 2 tsp",
        "Black Cardamom - 3 small",
        "baking soda - 1/4 tsp",
        "Black Salt - 1/2 tsp",
        "Garam Masala - 1/2 tsp",
        "fresh coriander leaves - 2 tbsp chopped",
        "Cumin Powder - 1 tsp",
        "Amchoor Powder / Mango Powder - 1 tsp",
        "Red Chili Powder - 1 tsp",
        "Coriander Powder - 1/2 tsp",
        "Ghee - 3 tbsp",
        "Ginger - 2 inch julliened"],
      "steps": ["Soak the chole in water for 7-8 hours or until they double in volume.",
        "Once the chole is ready, add them into the pressure cooker along with the water. Add the tea leaves which has been tied in a muslin cloth. Add the salt, black cardamom and baking soda.",
        "Cook the chole over high heat for about 5 whistles, after that lower the flame and cook for further 15 minutes. Once done allow the pressure cooker to naturally cool down.",
        "Once done strain the chole, remove the tea bag and the black cardamom. Transfer the chole in a Kadhai or a wok.",
        "Add the salt, black salt, black pepper, turmeric, garam masala, fresh coriander, cumin powder, amchoor powder and red chili powder.",
        "In a small pan add ghee and oil, once hot add the ajwain, ginger, anardana, garlic and green chili. Cook for 2-3 minutes.",
        "Finally add the red chili powder and cook for another 30 seconds. Add this tadka to the chole along with some ginger and over low heat cook the chole.",
        "If you want some gravy in the chole then add ½ cup of water and cook on high flame for 2-3 minutes.",
        "Serve the delicious Pindi Chole with hot Kulche.",
        ""]
    },
    {
      "img": "./assets/images/dinner/d4.jpg",
      "name": "So Cheesy Veg Pizza",
      "url": "56eRAEY1t8A",
      "detail": "Sprinkle over your favorite herbs and dig straight in!",
      "ingredient": ["Onion - 2 {finely chopped}",
        "Coconut - 1/4 cup",
        "Potato - 1/4 cup {roughly diced}",
        "Carrots - 1/4 cup {roughly diced}",
        "Cauliflower - 1/4 cup {small florets}",
        "Beans - 1/4 cup {chopped}",
        "Paneer - 50g {cubes}",
        "Oil - 2 tbsp + as required to shallow fry veggies",
        "Cumin Seeds - 1/2 tsp",
        "Curry Leaves - 4-5",
        "Blended Tomatoes - 6 Medium",
        "Ginger Garlic Paste - 1/2 tbsp",
        "Coriander - handful [chopped]",
        "Corn Flour - 1/2 tsp",
        "Capsicum - 1/4 cup {roughly diced}",
        "Coconut Milk - 3 tbsp",
        "Black Pepper - 1/4 tsp"],
      "steps": ["Preheat your oven to 250 C.",
        "Add the ingredients in a bowl/kneading plate and make a soft dough. Sprinkle some flour and divide into 2.",
        "In a floured surface, roll both the portions and transfer one of it to a baking pan/pizza pan or a tawa. Now spread loads of cream cheese in it. Place the second layer above it and stick them well.",
        "Cut strips of processed cheese and lay them in the edge of the pizza base sandwich. Now gather the edges and press down to stick them. Press down with fork.",
        "Prick holes using fork. And transfer the base into the preheated oven and cook for 4 mins.",
        "For Sauce. Mix everything and keep aside.",
        "For Finishing Pizza: Brush down the pizza with oil. Now spread the sauce, then mozzarella cheese, onions, capsicum, olives. Smear a few drops of oil.",
        "Transfer the pizza in the preheated oven and toast for 4 mins.",
        "Sprinkle over your favorite herbs and dig straight in!"]
    },
    {
      "img": "./assets/images/dinner/d5.jpg",
      "name": "Bengali Sponge Rasgulla",
      "url": "SipKS7W1Xd8",
      "detail": "",
      "ingredient": ["Onion - 2 {finely chopped}",
        "Coconut - 1/4 cup",
        "Potato - 1/4 cup {roughly diced}",
        "Cauliflower - 1/4 cup {small florets}",
        "Paneer - 50g {cubes}",
        "Oil - 2 tbsp + as required to shallow fry veggies",
        "Cumin Seeds - 1/2 tsp",
        "Sugar - 1/4 tsp",
        "Coconut Milk - 3 tbsp",
        "Mustard Seeds - 1/2 tsp"],
      "steps": ["Heat milk, stirring occasionally.",
        "Mix lemon juice with 2 tbsp of water. Line a colander with muslin cloth/dupatta/cheese cloth.",
        "Once, the milk boils, switch off the flame. Wait for 30 seconds, add about 1/2 of the lemon mixture and stir well.. It should start curdling. Add a few more drops and stirring again.",
        "Once the milk is curdled and greenish whey is out. Pass it through the cheese cloth lined colander",
        "Wash the chenna with some cold water. This will remove the lemon thing and will also help in making soft chenna.",
        "Gather the sides, and lightly squeeze the chenna. Dont apply much pressure. Lightly squeeze. After that, hang this for 30 mins in a kitchen tap or a cupboard.",
        "While the chenna is hanging, take a pot which is wide and is deep. The more the deeper and wider, the better! I took a cooker which is of 3.5l. Any pot works as i dint close the lid of it.",
        "Add 10-11* cups of water to the cooker and 2 cups* of sugar. Heat that up!",
        "Take the chenna out from the cheesecloth, it should be dry* but moist*. Start kneading this.",
        "Kneading time depends upon the quality of milk. I wont give a specific time, just knead until it gathers all together, no lumps and bumps are there. And some fat will start releasing, as soon as it starts releasing, stop there and make balls. Make smooth round balls of about 1 diameter.",
        "You would need atleast 4 of sugar syrup in the pot you are cooking and atleast 10 of width. Calculation behind it is, the 1 will expand into 2, and you atleast need 2 more for the rasgulla to swim in the syrup to ensure it is round. The more the height and width, its better!",
        "Now when the syrup is boiling, add the balls into it and cover it. Setup a timer of 15 mins! The water should be continuously vigorously boiling.. I keep the flame on the higher side!",
        "After 5 mins, open the lid once, and stir with utter care. Cover and do the same after 10 mins.",
        "As soon as the timer rings, transfer the rasgullas to a bowl with a good amount of syrup!",
        "Now the most patienctic thing, you'll need to wait for a 6-7 hours..",
        "After 6-7 hours, it'll be soft, juicy, moist, spongy, it'll hold its shape and will be heavenly!"]
    },
    {
      "img": "./assets/images/dinner/d6.jpg",
      "name": "Paneer Chili With Thai Flavors!",
      "url": "KSm_U7RX2bU",
      "detail": "Tip in the paneer, and toss well! Serve it straight from the pan!",
      "ingredient": ["Onion - 2 {finely chopped}",
        "Coconut - 1/4 cup",
        "Potato - 1/4 cup {roughly diced}",
        "Carrots - 1/4 cup {roughly diced}",
        "Cauliflower - 1/4 cup {small florets}",
        "Beans - 1/4 cup {chopped}",
        "Paneer - 50g {cubes}",
        "Oil - 2 tbsp + as required to shallow fry veggies",
        "Cumin Seeds - 1/2 tsp",
        "Curry Leaves - 4-5",
        "Blended Tomatoes - 6 Medium",
        "Ginger Garlic Paste - 1/2 tbsp",
        "Coriander - handful [chopped]",
        "Corn Flour - 1/2 tsp",
        "Capsicum - 1/4 cup {roughly diced}",
        "Coconut Milk - 3 tbsp",
        "Black Pepper - 1/4 tsp"],
      "steps": ["Quickly heat olive oil in a pan till very hot, add the Garlic and Thai chilies. Toss until light brown.",
        "Add the onions. Sauté well.",
        "Now add the cherry tomatoes, and toss well! It might get some flambé, that's what enhances the taste!",
        "Now add the bell pepper, toss well!",
        "Add in the sauces, mix well. Now add the salt, sesame and oregano, sugar, coriander, Mix well!",
        "Tip in the paneer, and toss well! Serve it straight from the pan!"]
    },
    {
      "img": "./assets/images/dinner/d7.jpg",
      "name": "Paneer Sabzi",
      "url": "XDh3HePh4EQ",
      "detail": "Mix well, and Serve Hot! Enjoy :)",
      "ingredient": ["Onion - 2 {finely chopped}",
        "Coconut - 1/4 cup",
        "Potato - 1/4 cup {roughly diced}",
        "Carrots - 1/4 cup {roughly diced}",
        "Cauliflower - 1/4 cup {small florets}",
        "Beans - 1/4 cup {chopped}",
        "Paneer - 50g {cubes}",
        "Oil - 2 tbsp + as required to shallow fry veggies",
        "Cumin Seeds - 1/2 tsp",
        "Curry Leaves - 4-5",
        "Blended Tomatoes - 6 Medium",
        "Ginger Garlic Paste - 1/2 tbsp",
        "Coriander - handful [chopped]",
        "Corn Flour - 1/2 tsp",
        "Capsicum - 1/4 cup {roughly diced}",
        "Coconut Milk - 3 tbsp",
        "Black Pepper - 1/4 tsp"],
      "steps": ["Start by heating a pan, add a tbsp of oil.",
        "While the oil is getting hot, take one onion and grate it using a grater. As the oil gets hot, add a tsp of cumin seeds and once they sizzle, add the grated onion.",
        "Stir well, add salt to taste and then let them cook in medium flame while they're cooking grate two tomatoes using a grater.",
        "Once the onions are cooked well, add the grated tomatoes and cook for about 30-40 seconds or until some what moisture is evaporated in high flame.",
        "Add the chili powder, turmeric and stir. Then add the coriander powder and cook the masalas well for about 30-40 in high flame. Add sugar if desired.",
        "Add the chopped paneer and stir well. Add about a 1/4 cup of milk and stir well, add more if desired. Get this to a boil, finish with chopped coriander and ENJOY!"]
    },
    {
      "img": "./assets/images/dinner/d8.jpg",
      "name": "Palak Paneer Recipe",
      "url": "V8tjvSLaCLg",
      "detail": "Mix well, and Serve Hot! Enjoy :)",
      "ingredient": ["Onion - 2 {finely chopped}",
        "Coconut - 1/4 cup",
        "Potato - 1/4 cup {roughly diced}",
        "Carrots - 1/4 cup {roughly diced}",
        "Cauliflower - 1/4 cup {small florets}",
        "Beans - 1/4 cup {chopped}",
        "Paneer - 50g {cubes}",
        "Oil - 2 tbsp + as required to shallow fry veggies",
        "Cumin Seeds - 1/2 tsp",
        "Curry Leaves - 4-5",
        "Blended Tomatoes - 6 Medium",
        "Ginger Garlic Paste - 1/2 tbsp",
        "Coriander - handful [chopped]",
        "Corn Flour - 1/2 tsp",
        "Capsicum - 1/4 cup {roughly diced}",
        "Coconut Milk - 3 tbsp",
        "Black Pepper - 1/4 tsp"],
      "steps": ["Start by heating up a pan, add a tablespoon of oil. To the hot oil, add the cumin seeds. Let them splutter, then add bayleaf, grated ginger, chopped garlic and green chili. Stir well.",
        "Once slightly cooked, add one roughly chopped onion and stir.. Add lil bit of salt and cook till it goes pink. Add the chopped tomatoes and cook till they are mushy.",
        "Switch off the flame and let the pan cool a little bit. Then add in the smooth yogurt and stir well for about a minute. Time for the spices – ¼ tsp turmeric, ½ tsp coriander powder, ½ tsp cumin powder, ½ tsp red chili powder and then grate in some nutmeg.",
        "Start the flame in low, and stir well and cook until starts getting a simmer. If the mixture seems dry 2-3 more tbsp. yogurt can be added. Add the sugar and mix well, then comes in the chopped spinach.",
        "Keep stirring and cook till the volume reduces, and the spinach is slightly wilted. After the volume is reduced, cook for another minute. Switch off the flame, add the coriander mix and make a paste out of it.",
        "Heat up a pan, add the paste and get it to a simmer.. Add more salt if required, also add the 2 tbsp cream. Mix well.",
        "Grate about 25-30 grams of paneer straight in the pan, and chop rest.. Mix well, and Serve Hot! Enjoy :)"]}
  ]
}
